load-tests/artillery/game-load.yml
# Load - "동시 접속 N명"을 실제로 만들어 유지하는 테스트. 한 번 실행이 곧 한 단계다.
#
# arrivalCount는 "투입할 VU 총수"이고, 각 VU는 holdUntil까지 소켓을 붙잡고 계속 플레이한다
# (processors/game.ts 참고). 따라서 램프업이 끝난 뒤부터는
#
#     동시 접속 = LOAD_CONCURRENT_USERS = LOAD_ROOMS x LOAD_USERS_PER_ROOM
#
# 이 성립한다. 실제로 그 수에 도달했는지는 리포트의 game.socket.concurrent (max/p95)로
# 확인한다 - 설정값을 믿지 말고 실측값을 본다.
#
# 25 -> 50 -> 100 -> 200 -> 300 단계는 이 파일을 값만 바꿔 여러 번 실행하는 방식이다.
# 한 번에 다 올리면 어느 지점에서 꺾였는지 알 수 없고, 단계 사이에 중단 기준을 판정할
# 틈도 없다. README의 "단계별 테스트" 참고.
config:
  target: "{{ $processEnvironment.LOAD_TARGET }}"
  phases:
    - name: ramp-up
      duration: "{{ $processEnvironment.LOAD_ARRIVAL_SECONDS }}"
      arrivalCount: "{{ $processEnvironment.LOAD_CONCURRENT_USERS }}"
  processor: "./processors/game.ts"
  # ensure는 config.ensure만 써서는 로드되지 않는다 - config.plugins에 등록해야
  # 플러그인이 적재되고, 그 다음에야 아래 ensure 블록을 읽는다.
  plugins:
    ensure: {}
  # 램프업 + 유지 시간보다 넉넉해야 한다. 짧으면 정상 동작 중인 VU가 잘려 실패로 잡힌다.
  timeout: 600

  # 중단 기준을 문서가 아니라 "실행 가능한 검사"로 둔다. 위반하면 artillery가 non-zero로
  # 종료하므로, 단계별로 돌릴 때 다음 단계로 넘어가면 안 된다는 것을 바로 알 수 있다.
  # 임계값 근거와 CloudWatch 쪽 중단 기준은 README의 "중단 기준" 표에 있다.
  ensure:
    thresholds:
      # 소켓 왕복(time:sync ACK). 실시간 게임에서 이 이상이면 체감된다.
      - "game.socket.ack_ms.p95": 500
      # game:ready -> 라운드 실제 시작. 방 락 경합이 가장 먼저 드러나는 지표다.
      - "game.round.start_ms.p95": 3000
    conditions:
      # VU 실패는 1% 미만이어야 한다(25명 기준 0명, 300명 기준 3명 미만).
      - expression: "vusers.failed < vusers.created * 0.01"
      # 목표 동시 접속에 실제로 도달했는지(기본 90% 이상). 도달하지 못했다면 그 단계의
      # 결과는 "N명에서의 성능"이 아니므로 수치를 해석하면 안 된다 - 부하가 덜 걸린 채
      # "문제 없음"으로 오독하는 것이 이 테스트에서 가장 위험한 실수다.
      - expression: "game.socket.concurrent.max >= {{ $processEnvironment.LOAD_CONCURRENT_USERS }} * 0.9"

before:
  flow:
    - function: "createRoomPool"

scenarios:
  - name: "동시 접속 유지 - room 참가 -> 게임 반복 -> 퇴장"
    flow:
      - function: "playGame"