load-tests/artillery/game-spike.yml
# Spike - 이미 붙어 있는 사용자가 있는 상태에서 접속이 급증하는 상황.
#
# load와 다른 점은 "총량"이 아니라 "기울기"다. baseline 인원이 소켓을 붙잡고 게임을 하는
# 동안 짧은 구간에 접속이 몰릴 때, 소켓 핸드셰이크 / room:enter / Redis 커넥션이 어떻게
# 되는지를 본다. baseline VU도 holdUntil까지 유지되므로 급증 구간의 동시 접속은
#
#     SPIKE_BASELINE_USERS + SPIKE_USERS
#
# 가 되고, 실제 도달 여부는 game.socket.concurrent(max)로 확인한다.
#
# 이 시나리오는 방마다 인원이 고르게 차지 않을 수 있다(급증 구간 VU가 라운드로빈으로
# 흩어지므로). 방장이 인원을 다 기다리지 못하면 대기 후 그냥 시작하므로 흐름은 계속된다 -
# spike에서 보려는 것은 게임 완주율이 아니라 연결/입장 구간의 성공률과 지연이다.
config:
  target: "{{ $processEnvironment.LOAD_TARGET }}"
  phases:
    - name: baseline
      duration: "{{ $processEnvironment.SPIKE_BASELINE_SECONDS }}"
      arrivalCount: "{{ $processEnvironment.SPIKE_BASELINE_USERS }}"
    - name: spike
      duration: "{{ $processEnvironment.SPIKE_SECONDS }}"
      arrivalCount: "{{ $processEnvironment.SPIKE_USERS }}"
  processor: "./processors/game.ts"
  # ensure는 config.ensure만 써서는 로드되지 않는다 - config.plugins에 등록해야
  # 플러그인이 적재되고, 그 다음에야 아래 ensure 블록을 읽는다.
  plugins:
    ensure: {}
  timeout: 600

  # spike는 연결 구간만 엄격하게 본다. 라운드 진행(game.round.start_ms)은 인원이 고르게
  # 차지 않아 흔들리므로 임계값을 걸지 않는다.
  ensure:
    thresholds:
      - "game.socket.connect_ms.p95": 3000
      - "game.socket.ack_ms.p95": 1000
    conditions:
      # 급증 구간에서도 연결 실패는 1% 미만이어야 한다.
      - expression: "vusers.failed < vusers.created * 0.01"

before:
  flow:
    - function: "createRoomPool"

scenarios:
  - name: "동시 접속 유지 - room 참가 -> 게임 반복 -> 퇴장"
    flow:
      - function: "playGame"